# Import Packages

In [1]:
import pandas as pd

# Add in Data

In [4]:
students = pd.DataFrame(data = [["Student1","English","Undergrad", 4, 19],
                          ["Student2","CS", "Grad", 2, 26],
                          ["Student3","Math","Grad", 3, 29],
                          ["Student4","CS", "Undergrad", 3, 22],
                          ["Student5","Math", "Undergrad", 4, 20],
                          ["Student6","CS", "Undergrad", 3, 24]],
                columns = ["Student", "Major","Undergrad/Grad", "GPA", "Age"])

In [5]:
students.head(4)

    Student    Major Undergrad/Grad  GPA  Age
0  Student1  English      Undergrad    4   19
1  Student2       CS           Grad    2   26
2  Student3     Math           Grad    3   29
3  Student4       CS      Undergrad    3   22

In [6]:
students.head(3)

    Student    Major Undergrad/Grad  GPA  Age
0  Student1  English      Undergrad    4   19
1  Student2       CS           Grad    2   26
2  Student3     Math           Grad    3   29

# Subsetting

In [7]:
students.Major

0    English
1         CS
2       Math
3         CS
4       Math
5         CS
Name: Major, dtype: object

In [8]:
students[['Major','Age']]

     Major  Age
0  English   19
1       CS   26
2     Math   29
3       CS   22
4     Math   20
5       CS   24

# Descriptive Statistics Functions

In [9]:
students.describe()

            GPA        Age
count  6.000000   6.000000
mean   3.166667  23.333333
std    0.752773   3.777124
min    2.000000  19.000000
25%    3.000000  20.500000
50%    3.000000  23.000000
75%    3.750000  25.500000
max    4.000000  29.000000

In [10]:
students.describe(include=['O'])

         Student Major Undergrad/Grad
count          6     6              6
unique         6     3              2
top     Student1    CS      Undergrad
freq           1     3              4

In [11]:
students.Age.mean()

23.333333333333332

In [12]:
students.Age.median()

23.0

In [13]:
students.Age.std()

3.777124126457412

In [14]:
students.Major.value_counts()

CS         3
Math       2
English    1
Name: Major, dtype: int64

# Import Data - CSV

In [2]:
Honey = pd.read_excel('../../Data/datasets_20465_26638_honeyproduction.xlsx')

In [3]:
Honey.head()

  state  numcol  yieldpercol  totalprod  stocks  priceperlb  prodvalue  year
0    WY   34000           36    1224000  282000        1.59    1946000  2010
1    WY   35000           54    1890000  265000        1.72    3251000  2011
2    WY   37000           72    2664000  746000        0.61    1625000  1999
3    WY   37000           48    1776000  391000        1.43    2540000  2009
4    WY   38000           77    2926000  468000        0.65    1902000  2001